# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных позициях. 
# Позиции хранятся в отдельном списке( пример n=4, lst1=[4,-2,1,3] - 
# списком на основе n, а позиции элементов lst2=[3,1].

N = int(input('Введите число'))
numbers = []
for i in range(N):
    numbers((-N,N+1))
    
print(numbers)

print(numbers[1] * numbers[3])


# Так и не осилил эту задачу, не поняв возможно задание